cask_args appdir: '/Applications'

tap "homebrew/bundle"
tap "oven-sh/bun"
tap "hashicorp/tap"

# brew "act" # Run your GitHub Actions locally
brew "bun" # Incredibly fast JavaScript runtime, bundler, test runner, and package manager – all in one
brew "caddy" # Fast, cross-platform HTTP/2 web server with automatic HTTPS
brew "coreutils" # GNU File, Shell, and Text utilities
brew "ffmpeg"
brew "gh" # GitHub command-line tool
brew "git" # Distributed revision control system
brew "github-keygen" # Bootstrap GitHub SSH configuration
brew "gnupg" # GNU Pretty Good Privacy (PGP) package
# brew "go@1.19" # Open source programming language to build simple/reliable/efficient software
brew "graphviz" # Graph visualization software from AT&T and Bell Labs
brew "gradle" # Build system for multiple languages and environments
brew "hub" # Add GitHub support to git on the command-line
brew "java" # Development kit for the Java programming language
brew "libpq" # PostgreSQL C client library
brew "mas" # Mac App Store command-line interface
brew "maven" # Java-based project management
brew "mkcert" # Tool to generate trusted certificates
brew "n" # Node version management
brew "neonctl" # CLI for Neon
brew "node" # Platform built on V8 to build network applications
brew "openjdk" # Development kit for the Java programming language
brew "pinentry-mac" # Pinentry for GPG on Mac
brew "python-setuptools" # Python setup tools
brew "rbenv" # Ruby version manager
brew "svgo" # Nodejs-based tool for optimizing SVG vector graphics files
brew "terraform" # Tool for building, changing, and versioning infrastructure
brew "vips" # Image processing library
brew "wget" # Internet file retriever
brew "x265" # H.265/HEVC video encoder
brew "yarn" # JavaScript package manager
brew "yt-dlp" # Fork of youtube-dl with additional features and fixes

cask "1password" # Password manager that keeps all passwords secure behind one password
cask "1password-cli" # Command-line helper for the 1Password password manager
cask "cursor" # Code editor
cask "arc" # Chromium based browser
cask "discord" # Voice and text chat software
cask "docker" # App to build and share containerized applications and microservices
cask "elgato-control-center" # Control your Elgato key lights
cask "elgato-stream-deck" # Assign keys, and then decorate and label them
cask "firefox" # Web browser
cask "github" # Github Desktop
cask "goland" # Go (golang) IDE
cask "google-chrome" # Web browser
# cask "google-cloud-sdk" # Set of tools to manage resources and applications hosted on Google Cloud
cask "grammarly-desktop" # Writing assistant
cask "imageoptim" # Tool to optimize images to a smaller size
cask "krisp" # Noise cancelling application
cask "linear-linear" # App to manage software development and track bugs
cask "logi-options+" # Software for Logitech devices
cask "opal-composer" # Professional webcam software for the Opal C1
cask "raycast" # Control your tools with a few keystrokes
cask "rectangle-pro" # Window snapping tool
cask "tableplus" # Native GUI tool for relational databases
cask "tunnelbear" # VPN service
cask "visual-studio-code" # Open-source code editor
cask "zed" # Text and code editor
cask "zen-browser" # Browser with built-in privacy features

mas "1Password for Safari", id: 1569813296
# mas "Slack for Desktop", id: 803453959
mas "Xcode", id: 497799835
