tap "homebrew/bundle"
tap "oven-sh/bun"

brew "act" # Run your GitHub Actions locally
brew "bun" # Incredibly fast JavaScript runtime, bundler, test runner, and package manager – all in one
brew "caddy" # Fast, cross-platform HTTP/2 web server with automatic HTTPS
brew "coreutils" # GNU File, Shell, and Text utilities
brew "gh" # GitHub command-line tool
brew "git" # Distributed revision control system
brew "github-keygen" # Bootstrap GitHub SSH configuration
brew "gnupg" # GNU Pretty Good Privacy (PGP) package
# brew "go" # Open source programming language to build simple/reliable/efficient software
brew "go@1.19" # Open source programming language to build simple/reliable/efficient software
brew "graphviz" # Graph visualization software from AT&T and Bell Labs
brew "hub" # Add GitHub support to git on the command-line
brew "mas" # Mac App Store command-line interface
brew "mkcert" # Tool to generate trusted certificates
brew "n" # Node version management
brew "node" # Platform built on V8 to build network applications
brew "pinentry-mac" # Pinentry for GPG on Mac
brew "svgo" # Nodejs-based tool for optimizing SVG vector graphics files
brew "vips" # Image processing library
brew "wget" # Internet file retriever
brew "yarn" # JavaScript package manager
brew "yt-dlp" # Fork of youtube-dl with additional features and fixes

cask "1password" # Password manager that keeps all passwords secure behind one password
cask "1password-cli" # Command-line helper for the 1Password password manager
cask "arc" # Chromium based browser
cask "discord" # Voice and text chat software
cask "docker" # App to build and share containerized applications and microservices
cask "elgato-control-center" # Control your Elgato key lights
cask "elgato-stream-deck" # Assign keys, and then decorate and label them
cask "firefox" # Web browser
cask "gitpigeon" # GitHub notifications delivered to your Mac
cask "goland" # Go (golang) IDE
cask "google-chrome" # Web browser
cask "grammarly-desktop" # Writing assistant
cask "imageoptim" # Tool to optimize images to a smaller size
cask "krisp" # Noise cancelling application
cask "linear-linear" # App to manage software development and track bugs
cask "logi-options-plus" # Software for Logitech devices
cask "logitech-g-hub" # Software for Logitech devices
cask "opal-composer" # Professional webcam software for the Opal C1
cask "raycast" # Control your tools with a few keystrokes
cask "rectangle-pro" # Window snapping tool
cask "tableplus" # Native GUI tool for relational databases
cask "tunnelbear" # VPN service
cask "visual-studio-code" # Open-source code editor
cask "zed" # Text and code editor

mas "1Password for Safari", id: 1569813296
mas "Slack for Desktop", id: 803453959
mas "Xcode", id: 497799835

# vscode "GitHub.codespaces"