tap "homebrew/bundle"

brew "coreutils" # GNU File, Shell, and Text utilities
brew "docker" # Pack, ship and run any application as a lightweight container
brew "gh" # GitHub command-line tool
brew "git" # Distributed revision control system
brew "github-keygen" # Bootstrap GitHub SSH configuration
brew "gnupg" # GNU Pretty Good Privacy (PGP) package
brew "go@1.19" # Open source programming language to build simple/reliable/efficient software
brew "hub" # Add GitHub support to git on the command-line
brew "mas" # Mac App Store command-line interface
brew "n" # Node version management
brew "node" # Platform built on V8 to build network applications
brew "pinentry-mac" # Pinentry for GPG on Mac
brew "svgo" # Nodejs-based tool for optimizing SVG vector graphics files
brew "wget" # Internet file retriever
brew "yt-dlp" # Fork of youtube-dl with additional features and fixes

cask "1password" # Password manager that keeps all passwords secure behind one password
cask "1password-cli" # Command-line helper for the 1Password password manager
cask "discord" # Voice and text chat software
cask "elgato-control-center" # Control your Elgato key lights
cask "elgato-stream-deck" # Assign keys, and then decorate and label them
cask "fig" # Reimagine your terminal
cask "firefox" # Web browser
cask "google-chrome" # Web browser
cask "imageoptim" # Tool to optimize images to a smaller size
cask "krisp" # Noise cancelling application
cask "linear-linear" # App to manage software development and track bugs
cask "logi-options-plus" # Software for Logitech devices
# cask "opal" # Professional webcam software for the Opal C1 (Note: not up-to-date)
cask "raycast" # Control your tools with a few keystrokes
cask "rectangle-pro" # Window snapping tool
cask "tidal" # Music streaming service with high fidelity sound and hi-def video quality
cask "visual-studio-code" # Open-source code editor

mas "1Password for Safari", id: 1569813296
mas "Grammarly: Writing App", id: 1462114288
mas "Slack for Desktop", id: 803453959
mas "Xcode", id: 497799835

# vscode "GitHub.codespaces"